# Для продолжения использовать уже созданный на прошлых занятиях класс Point со свойствами color и circle и методами
# set_coords    get_coords.
#
# Для того чтоб св-ва объектов создавались не посредством метода set_coords а более удобно, создать метод __init__
#
# В методе __init__ сначала просто определить вывод строки 'вызов метода init' и создание двух лок. св-тв x,
# y со значениями 0.

# Переопределить объект pt так, что бы он принимал эти параметры.
#
# Вывести лок. св-ва объектов через дандер метод.
#
# Вывести лок. св-ва объектов через дандер метод.
#
# Переопределить init так что бы он сразу принимал на вход параметры a, b для присвоения их  x, y
#
# Переопределить метод init так чтоб вместо a, b  в параметры записывались имена переменных сразу таки же как нам
# надо: x, y.
#
# Определить init так чтоб x, y присваивались значения 1, 2
#
# Вывести эти локальные св-ва методом dict.
#
# Переопределить init так, чтобы параметры x, y были формальными и по умолчанию принимали 0.
#
# Теперь создать объект pt, не передавая на вход никаких параметров и вывести локальные св-ва dict объектов.
# Убедиться что они равны 0.
#
# Определит метод __del__ который выводит строку "удаление экземпляра + строчная ссылка на экземпляр"
#
# Просто запустить программу без вызова метода __del__ и убедиться что он сработал автоматически.
#
#
#
#
#
#
#
#
#
#
#
#